In [5]:
import pandas as pd;
from sqlalchemy import create_engine
import mysql.connector

In [6]:
#step#1 connection string
username='root'
password='Basel00272727$'
host='127.0.0.1'
port='3306'
databaseName='sakila'

#connection string format
connectionStr=f"mysql+pymysql://{username}:{password}@{host}:{port}/{databaseName}"

In [7]:
engine=create_engine(connectionStr)

In [2]:
df = pd.read_csv('rental.csv')

In [3]:
df.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [4]:
df.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
16039    False
16040    False
16041    False
16042    False
16043    False
Length: 16044, dtype: bool

In [5]:
df[df.duplicated()]
df.drop_duplicates(inplace=True)

In [4]:
import pandas as pd

# 📂 تحميل البيانات من rental.csv
df_raw = pd.read_csv('rental.csv')

# 🧹 حذف الصفوف التي تفتقد أي من القيم المطلوبة (عدا last_update)
columns_required = ['rental_id', 'rental_date', 'inventory_id', 'customer_id', 'return_date', 'staff_id']
df = df_raw.dropna(subset=columns_required)

# 🗑️ حذف التكرارات في العمود الأساسي rental_id (نأخذ أول ظهور فقط)
df = df.drop_duplicates(subset=['rental_id'], keep='first')

# 🧼 تحويل last_update الفارغة إلى None
df['last_update'] = df['last_update'].where(pd.notnull(df['last_update']), None)

# ✅ النتيجة المؤقتة بعد التنظيف
print(df.head())

   rental_id          rental_date  inventory_id  customer_id  \
0          1  2005-05-24 22:53:30           367          130
1          2  2005-05-24 22:54:33          1525          459
2          3  2005-05-24 23:03:39          1711          408
3          4  2005-05-24 23:04:41          2452          333
4          5  2005-05-24 23:05:21          2079          222

           return_date  staff_id          last_update
0  2005-05-26 22:04:30         1  2006-02-15 21:30:53
1  2005-05-28 19:40:33         1  2006-02-15 21:30:53
2  2005-06-01 22:12:39         1  2006-02-15 21:30:53
3  2005-06-03 01:43:41         2  2006-02-15 21:30:53
4  2005-06-02 04:33:21         1  2006-02-15 21:30:53

In [8]:
df.to_sql(name='dim_rent', con=engine, if_exists='append', index=False)

15861